Documentation update
Signed-off-by: Jacek Pielaszkiewicz <jacek.pielaszkiewicz@gmail.com>
